# Объектно-ориентированное программирование  

## Лабораторная работа №1  
---  
#### Теоретическая справка   

##### CSV - Comma-separated values  
> CSV - Comma-separated values – формат хранения данных, в котором данные разделены запятыми или точка-запятыми. Каждая запись данных располагается на отдельной строке, а каждое поле внутри записи разделяется запятой.  

**Пример СSV-файла**  
```csv
1; BMW M5; 0; 2022
2; Porsche Cayenne; 1; 2020  
```
---

##### Enum   
> Enum (англ. enumeration) в C++ является типом данных, который представляет собой набор константных целочисленных значений. Каждое значение имеет своё уникальное имя, которое может быть использовано в коде вместо соответствующего числового значения. Это позволяет улучшить читабельность кода и сделать его более надежным.

  
```cpp
enum Color
{
    RED, GREEN, BLUE, WHITE, BLACK, YELLOW, ORANGE, GRAY
    //RED == 0, GREEN == 1, ... , GRAY == 7
};

Color background = Color::BLUE;

std::cout << "Color: " << background << std::endl; //Color: 2
```  
---

##### Сортировка  
Методов сортировки существует множество, рассмотрим функцию сортировки из STL библиотеки. 
Пример сортировки:  
```cpp
#include <algorithm>

std::vector<int> numbers = {3, 1, 4, 1, 5, 9, 2, 6};
std::sort(numbers.begin(), numbers.end(), [](int a, int b){ 
    return a < b; 
});
```

P.S Кто напишет лучший собственный метод сортировки с лучшим O(n), тот получит +балл на экзамене. :)  

---

##### Чтение файлов  
Для чтения файлов используется класс ifstream из fstream. 
```cpp
#include <fstream>

int main() {
    std::ifstream file("example.txt");

    if (file.is_open()) {
        std::string line;

        while (!file.eof()) {
            std::getline(file, line)
            std::cout << line << std::endl;
        }

        file.close();   
    } else {
        std::cout << "Failed to open file" << std::endl;
    }
    return 0;
}

```

P.S Теория будет пополняться.

---
## **Задание**  
В данном курсе на лабораторных работах мы будем разрабатывать программу для работы и взаимодействия с геометрическими объектами.  

В первой лабораторной работе необходимо написать программу, которая будет считывать из CSV файла (файл будет дан) данные, сортировать их и выводить в консоль. 

P.S Что-то можно поменять или переписать

---  
#### **Варианты**   

CSV файл с данными у всех один. Необходимо считать заданные данные.
Пример, как выглядит CSV файл внутри.
```csv
id; figure-name; angles; color(enum)
```

1. Вариант 

Считать фигуры: **трапеции, пятиугольники, шестиугольники.** 
Если такой фигуры нету в файле, то выдать сообщение об ошибке ??**и добавить ее самостоятельно.**??  

***Отсортировать фигуры по количеству углов. Вывести в консоль все трапеции синего цвета.***

* ID
* Модель автомобиля
* Цвет *(enum)*
* Стоимость (млн)  

1. Данные о сотрудниках: 
* Номер записи / ID
* ФИО 
* Год трудоустройства
* Пол *(enum)*
  
***Отсортировать по возрасту. Вывести всех сотрудников со стажем больше 5 лет.*** 

3. Данные о занятиях: 
* Номер записи / ID
* Предмет
* Тип занятия *(Лекция, практика, лабораторная, экзамен. enum)*
* Аудитория  
  
***Отсортировать по аудиториям. Вывести всех пары в аудитории 4329.*** 

---

#### **Этапы выполнения**  

1. Разобрать пример реализации функции split, проверить работоспособность с помощью отладчика. Найти ошибки в реализации, пофиксить.
```cpp
std::vector<std::string> split(const std::string& str, char delim)
{
    std::vector<std::string> tokens;

    if (!str.empty()){
        size_t start = 0, end;
        do {
            tokens.push_back(str.substr(start, (end - start)));
            end = str.find(delim, start);
            start = end + 1;
        } while (end != std::string::npos);
    }

    return tokens;
}
```  
2. Используя исправленную функцию split и функции потокового чтения из файла, сделать чтение записей.
3. Добавить сортировку и вывод данных.  

4. Добавить вывод отсортированных данных в файл.

---
